Autodesk.Revit.Exceptions.InsufficientResourcesException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Retrieves data needed to serialize the target object.
info: Data needed to serialize or deserialize the object.
context: The destination of the serialized stream.

Autodesk.Revit.Exceptions.InsufficientResourcesException
The exception that is thrown when the OS runs out of resources,
e.g. memory, disk space, or USER or GDI objects.